---
title: CurveLoopIterator
classe: Autodesk.Revit.DB.CurveLoopIterator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# CurveLoopIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Curve Current { get; }` | `curveLoopIterator.Current` | Curve |
| `Boolean IsValidObject { get; }` | `curveLoopIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `curveLoopIterator.Dispose()` | Void |
| `Boolean MoveNext()` | `curveLoopIterator.MoveNext()` | Boolean |
| `Void Reset()` | `curveLoopIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```